/**
 * Задание №1. Игра «Виселица» Реализуй игру «Виселица», где игрок пытается угадать слово,
 * вводя одну букву за раз. Если буква отсутствует в слове, то игрок теряет жизнь.
 * Игра заканчивается, когда игрок угадывает слово или теряет все жизни.
 * Слово для отгадывания выбирать случайно из списка слов-констант внутри программы.
 * После каждой введенной буквы выводить в консоль загадываемое слово с пропусками букв
 * и сообщение о том, сколько жизней осталось. Рисовать в консоли человечка на виселице
 * как иллюстрацию количества жизней (как это обычно бывает в «Виселице») не обязательно,
 * но будет приветствоваться.
 */

package ru.evendot.task1;

public class Main{
    public static void main(String[] args) {

    }
}